<!-- GitHub Actions Terraform PR comment bot -->
#### Terraform Initialization ⚙️`success`

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
Acquiring state lock. This may take a few moments...
hcloud_server.demo[0]: Refreshing state... [id=63138300]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # hcloud_server.demo[0] must be replaced
-/+ resource "hcloud_server" "demo" {
      + backup_window              = (known after apply)
      ~ datacenter                 = "hel1-dc2" -> (known after apply)
      ~ firewall_ids               = [] -> (known after apply)
      ~ id                         = "63138300" -> (known after apply)
      ~ ipv4_address               = "157.180.22.33" -> (known after apply)
      ~ ipv6_address               = "2a01:4f9:c012:c234::1" -> (known after apply)
      ~ ipv6_network               = "2a01:4f9:c012:c234::/64" -> (known after apply)
      - labels                     = {} -> null
      ~ location                   = "hel1" -> (known after apply)
        name                       = "testing-demo"
      - placement_group_id         = 0 -> null
      ~ primary_disk_size          = 40 -> (known after apply)
      ~ status                     = "running" -> (known after apply)
      ~ user_data                  = "eBdhIQksv/xNhvckepV+YnmTVxQ=" -> "DhQDR6GiJSN2jtFg1k1lTbK12TY=" # forces replacement
        # (9 unchanged attributes hidden)

      - public_net {
          - ipv4         = 0 -> null
          - ipv4_enabled = true -> null
          - ipv6         = 0 -> null
          - ipv6_enabled = true -> null
        }
      + public_net {
          + ipv4         = (known after apply)
          + ipv4_enabled = true
          + ipv6         = (known after apply)
          + ipv6_enabled = true
        }
    }

Plan: 1 to add, 0 to change, 1 to destroy.

Changes to Outputs:
  ~ ipv4_address = "157.180.22.33" -> (known after apply)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
Releasing state lock. This may take a few moments...

```

</details>
*Pushed by: @bruzina, Action: `pull_request`*